zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_MC_ME.h
#define MC_ME_PRTN2_COFB2_STAT_BLOCK66_MASK      (0x4U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK66_SHIFT     (2U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK66_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK66(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK66_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK66_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK67_MASK      (0x8U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK67_SHIFT     (3U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK67_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK67(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK67_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK67_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK68_MASK      (0x10U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK68_SHIFT     (4U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK68_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK68(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK68_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK68_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK69_MASK      (0x20U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK69_SHIFT     (5U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK69_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK69(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK69_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK69_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK70_MASK      (0x40U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK70_SHIFT     (6U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK70_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK70(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK70_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK70_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK71_MASK      (0x80U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK71_SHIFT     (7U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK71_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK71(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK71_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK71_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK72_MASK      (0x100U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK72_SHIFT     (8U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK72_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK72(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK72_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK72_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK73_MASK      (0x200U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK73_SHIFT     (9U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK73_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK73(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK73_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK73_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK74_MASK      (0x400U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK74_SHIFT     (10U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK74_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK74(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK74_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK74_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK75_MASK      (0x800U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK75_SHIFT     (11U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK75_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK75(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK75_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK75_MASK)
/*! @} */

/*! @name PRTN2_COFB0_CLKEN - Partition 2 COFB Set 0 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN2_COFB0_CLKEN_REQ4_MASK        (0x10U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ4_SHIFT       (4U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ4_WIDTH       (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ4(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ4_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ4_MASK)

#define MC_ME_PRTN2_COFB0_CLKEN_REQ5_MASK        (0x20U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ5_SHIFT       (5U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ5_WIDTH       (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ5(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ5_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ5_MASK)

#define MC_ME_PRTN2_COFB0_CLKEN_REQ6_MASK        (0x40U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ6_SHIFT       (6U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ6_WIDTH       (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ6(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ6_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ6_MASK)

#define MC_ME_PRTN2_COFB0_CLKEN_REQ7_MASK        (0x80U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ7_SHIFT       (7U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ7_WIDTH       (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ7(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ7_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ7_MASK)

#define MC_ME_PRTN2_COFB0_CLKEN_REQ8_MASK        (0x100U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ8_SHIFT       (8U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ8_WIDTH       (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ8(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ8_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ8_MASK)

#define MC_ME_PRTN2_COFB0_CLKEN_REQ9_MASK        (0x200U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ9_SHIFT       (9U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ9_WIDTH       (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ9(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ9_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ9_MASK)

#define MC_ME_PRTN2_COFB0_CLKEN_REQ10_MASK       (0x400U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ10_SHIFT      (10U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ10_WIDTH      (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ10(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ10_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ10_MASK)

#define MC_ME_PRTN2_COFB0_CLKEN_REQ11_MASK       (0x800U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ11_SHIFT      (11U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ11_WIDTH      (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ11(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ11_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ11_MASK)

#define MC_ME_PRTN2_COFB0_CLKEN_REQ12_MASK       (0x1000U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ12_SHIFT      (12U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ12_WIDTH      (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ12(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ12_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ12_MASK)

